---
kind: method
id: M:Autodesk.Revit.DB.DWGExportOptions.#ctor
source: html/36314aba-5818-8292-1655-b386f836d10c.htm
---
# Autodesk.Revit.DB.DWGExportOptions.#ctor Method

Constructs a new instance of DWGExportOptions with default values of all properties.

## Syntax (C#)
```csharp
public DWGExportOptions()
```